rails-payers/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
    def point_total
        # debugger
        render json: {points: Transaction.sum(&:points)}