rails-payers/app/controllers/transactions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "payers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "STOKER"], ["created_at", "2022-04-26 19:04:56.844792"], ["updated_at", "2022-04-26 19:04:56.844792"]]
SELECT "payers".* FROM "payers" WHERE "payers"."name" = $1 LIMIT $2  [["name", "DANNON"], ["LIMIT", 1]]
INSERT INTO "transactions" ("user_id", "payer_id", "points", "timestamp") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["payer_id", 1], ["points", 5000], ["timestamp", "2022-04-26 19:01:29.448636"]]
---
    def add_transaction
        current_user = User.find(params[:user_id])
        found_or_created_payer = Payer.find_or_create_by(name: params[:payer])
        transaction = Transaction.create!(user: current_user, payer: found_or_created_payer, points: params[:points], timestamp: params[:timestamp])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
---
    def spend_points
        current_user = User.find(params[:user_id])
        current_total = params[:points]

        output = []

        i = 0

        while current_total > 0 && current_user.transactions.length > i

SELECT "transactions".* FROM "transactions"
---
    def index
        render json: Transaction.all, include: [:payer]

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Transaction.find(params[:id])