rails-payers/app/models/user.rb

    def total_points
        self.transactions.sum(:points)
---
SELECT SUM("transactions"."points") FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]