app/controllers/payers_controller.rb

    def index
        render json: Payer.all
---
SELECT "payers".* FROM "payers"

    def show
        render json: Payer.find(params[:id])
---
SELECT "payers".* FROM "payers" WHERE "payers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]